docs/media/makefile-doc.dot
digraph G {
n2[label="all", color="red"];
n31[label="interesting-score.rocks\n11h52m\n160MB", color="green"];
n29[label="allowed-categories.txt\n31s\n18MB", color="green"];
n14[label="allowed-lists.txt\n5s\n835KB", color="green"];
n30[label="categories.json\n31s\n55MB", color="green"];
n24[label="category_members.jsonl\n1m31s\n702MB", color="green"];
n33[label="category_members_all_info.jsonl\n24m\n2.8GB", color="green"];
n17[label="db1.rocks\n5m\n182MB", color="green"];
n16[label="db1_rev.rocks\n5m\n136MB", color="green"];
n19[label="db3.rocks\n\n18MB", color="green"];
n28[label="⮊ enwiki-latest-categorylinks.sql.gz\n12m\n3.4GB", color="green"];
n13[label="⮊ enwiki-latest-pagelinks.sql.gz\n27m\n7.5GB", color="green"];
n27[label="enwiki-categories.csv\n48m\n1.3GB", color="green"];
n21[label="⮊ enwiki-latest-redirect.sql.gz\n34s\n153MB", color="green"];
n12[label="enwiki-pagelinks.csv\n4h28m\n936MB", color="green"];
n20[label="index_enwiki-latest.db\n19m\n2.2GB", color="green"];
#n18[label="latest-all.nt.bz2.filtered.bz2\n20h29m\n3.5GB", color="red"];
n9[label="list_members.jsonl\n1m31s\n765MB", color="green"];
n7[label="list_members_all_info.jsonl\n7m\n750MB", color="green"];
n15[label="lists.json\n7s\n12MB", color="green"];
n26[label="mapped-categories.csv\n8m\n1.4GB", color="green"];
n11[label="mapped-lists.csv\n1m49s\n1.8GB", color="green"];
n6[label="merged.jsonl\n4m\n3.4GB", color="green"];
n5[label="merged-without-letters.jsonl\n3m40s\n3.4GB", color="green"];
n4[label="merged-without-duplicates.jsonl\n3m30s\n3.4GB", color="green"];
n3[label="merged_final.jsonl\n32m\n8.2GB", color="green"];
n25[label="sorted-categories.csv\n41s\n1.4GB", color="green"];
n10[label="sorted-lists.csv\n24s\n1.8GB", color="green"];
n32[label="suggestable_domains.csv\n110MB", color="red"];
n23[label="validated_category_members.jsonl\n37m\n735MB", color="green"];
n8[label="validated_list_members.jsonl\n32m16s\n199MB", color="green"];
n34[label="⮊ latest-truthy.nt.bz2\n2h10m\n36GB", color="green"];
n35[label="latest-truthy.nt.bz2.filtered.bz2\n2h40m\n3.3GB", color="green"];
#n36[label="⮊ latest-all.nt.bz2\n11h20m\n151GB", color="red"];
n37[label="⮊ enwiki-latest-page_props.sql.gz\n2m\n357MB", color="green"];
n38[label="⮊ enwiki-latest-page.sql.gz\n8m\n357MB", color="green"];
n39[label="qrank.csv\n6s\n332MB", color="green"];
n40[label="db2.rocks\n\n630MB", color="green"];
n41[label="db4.rocks\n\n2.7MB", color="green"];
n42[label="db5.rocks\n\n7.3GB", color="green"];
n43[label="db6.rocks\n\n70MB", color="green"];
n44[label="avatars-emojis.csv\n9.4KB", color="green"];
n45[label="uniq_category_members.txt\n33m\n57MB", color="green"];
n46[label="uniq_list_members.txt\n23m\n34MB", color="green"];
n31 -> n33;
n31 -> n7;
n8 -> n46
n23 -> n45;
n3 -> n2 ; 
n45 -> n31; 
n46 -> n31; 
n30 -> n29 ; 
n20 -> n14 ; 
n15 -> n14 ; 
n16 -> n30 ; 
n19 -> n30 ; 
n30 -> n24 ; 
n25 -> n24 ; 
n32 -> n33 ; 
n23 -> n33 ; 
n20 -> n17 ; 
n20 -> n16 ; 
n29 -> n27 ; 
n28 -> n27 ; 
n14 -> n12 ; 
n13 -> n12 ; 
n21 -> n20 ; 
n15 -> n9 ; 
n10 -> n9 ; 
n32 -> n7 ; 
n8 -> n7 ; 
n16 -> n15 ; 
n19 -> n15 ; 
n27 -> n26 ; 
n20 -> n26 ; 
n12 -> n11 ; 
n20 -> n11 ; 
n33 -> n6 ; 
n7 -> n6 ; 
n6 -> n5 ; 
n5 -> n4 ; 
n4 -> n3 ; 
n26 -> n25 ; 
n11 -> n10 ; 
n24 -> n23 ; 
n9 -> n8 ; 
n34 -> n35;
#n36 -> n18;
n38 -> n20;
n17 -> n8 ; 
n40 -> n8 ; 
n43 -> n8 ; 
n20 -> n8 ; 
n17 -> n23 ; 
n40 -> n23 ; 
n43 -> n23 ; 
n20 -> n23 ; 
n42 -> n33 ; 
n42 -> n7 ; 
n20 -> n33 ; 
n20 -> n7 ; 
n41 -> n6 ;
n44 -> n3 ;
n39 -> n33 ;
n39 -> n7 ;
n35 -> n19 ;
n35 -> n40 ;
n35 -> n41 ;
n35 -> n42 ;
n35 -> n43 ;
n37 -> n20;
}
